// © Copyright 2004-2010, 2015-2016 HP Development Company, L.P.

TaskName = "Mise à jour du prologiciel";

// Errors
FileOpenError = "Impossible d'ouvrir le fichier %@.";
FileOpenErrorExplanation = "Ce fichier est peut-être endommagé ou a été déplacé vers un autre répertoire, renommé ou supprimé. Veuillez vérifier l'emplacement du fichier ou sélectionner un autre fichier et essayer de nouveau.";
PrintChannelOpenError = "Impossible d'ouvrir un canal d'imprimante.";
PrintChannelOpenErrorExplanation = "Veuillez vérifier si l'imprimante est branchée et activée, puis essayez de nouveau.";
SendDataError = "Impossible d'envoyer des données à l'imprimante.";
SendDataErrorExplanation = "Veuillez vérifier si l'imprimante est branchée et activée, puis essayez de nouveau.";

SomePenErrorTitle = "Impossible de mettre à jour le prologiciel.";
DoorOpenMsg = "Mise à jour du micrologiciel impossible parce qu'un capot est ouvert. Fermez tous les capots de l'imprimante.";

// Aquamarine Errors
FileCheckError = "Impossible de mettre à jour le prologiciel.";
FileCheckErrorExplanation = "Le prologiciel n'est pas valide. Veuillez sélectionner un autre fichier et essayer de nouveau.";

OkButton = "Ok";
CancelButton = "Annuler";
FirmwareUpdateTitle = "Mise à jour du prologiciel";
FirmwareUpdateDeviceState = "Impression";
FirmwareUpdateCancelingDeviceState = "Annulation";

// Great Wall Messages
PrinterIdleWarning = "La mise à jour du prologiciel pourrait échouer si votre imprimante est occupée (par exemple si elle imprime un document ou si elle effectue un calibrage).\n\nVeuillez vérifier si votre imprimante est libre avant d'effectuer une mise à jour du prologiciel.";
UpdateSuccessful = "Le fichier du prologiciel a été téléchargé avec succès, et votre imprimante va être mise à jour.\n\nUne fois la mise à jour du prologiciel terminée, votre imprimante redémarrera automatiquement.";
InvalidPackage = "Des problèmes se sont produits au niveau du fichier du prologiciel, et le processus de mise à jour n'a pas été effectué avec succès. Les problèmes ont peut-être été causés par une erreur de transmission.\n\nVeuillez lancer de nouveau le processus de mise à jour.\nSi le problème persiste, veuillez contacter le service clients de HP.";
FailedDependencies = "Le processus de mise à jour du prologiciel ne s'est pas terminé avec succès à cause de problèmes de dépendances.\n\nLa version actuelle du prologiciel est %@, et vous essayez d'installer %@.\n\nVeuillez visiter la page Web suivante afin de rechercher la version de mise à jour appropriée pour cette imprimante :\n%@.";
NotNow = "La mise à jour du prologiciel ne s'est pas effectuée avec succès parce que l'imprimante est occupée (par exemple elle imprime ou traite un travail d'impression).\n\nVeuillez vérifier si votre imprimante est libre, et effectuez de nouveau la mise à jour.";
TransmissionError = "Des problèmes ont eu lieu avec la transmission, et la mise à jour du prologiciel ne s'est pas effectuée avec succès.\n\nVeuillez vérifier le branchement de votre imprimante, puis effectuer de nouveau la mise à jour.";
LicenseNotAccepted = "La mise à jour du prologiciel ne s'est pas effectuée parce que la licence n'a pas été acceptée.";
FatalError = "Des problèmes ont eu lieu, et le processus de mise à jour du prologiciel ne s'est pas terminé avec succès.\n\nSi le problème persiste, veuillez contacter le service clients de HP.";

// layout
TaskTitle = "Mise à jour du prologiciel";
TaskDescription = "Sélectionnez un fichier contenant une mise à jour du prologiciel et transférez-le sur l'imprimante pour le mettre à jour.";
FileNameTitle = "Nom du fichier :";
FileNameField = "<Non sélectionné>";
ChooseButton = "Choisir…";
UpdateButton = "Mettre à jour";
ProgressPanel = "Progression de la mise à jour";
FirmwareUpdateProcessTitle = "Mise à jour…";
